EDT/УТ/src/Catalogs/ГруппыПолигоновМаршрутизации/ГруппыПолигоновМаршрутизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыПолигоновМаршрутизации</name>
  <attributes>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолигоныМаршрутизации</name>
    <attributes>
      <name>НомерПолигона</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/InformationRegisters/ПолигоныОпределенияСменыМаршрутизации/ПолигоныОпределенияСменыМаршрутизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПолигоныОпределенияСменыМаршрутизации</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПолигонУчитывается</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРейсов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаПолигоновМаршрутизации</name>
    <type>
      <types>CatalogRef.ГруппыПолигоновМаршрутизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПолигонаМаршрутизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Catalogs/ГруппыПолигоновМаршрутизации/ObjectModule.bsl
&НаСервере
Функция ПроверкаНаличияДанныхВРСПолигоныОпределенияСменыМаршрутизации(НомераПолигонов = Неопределено) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПолигоныОпределенияСменыМаршрутизацииСрезПоследних.Период КАК Период,
		|	ПолигоныОпределенияСменыМаршрутизацииСрезПоследних.НомерПолигонаМаршрутизации КАК НомерПолигонаМаршрутизации,
		|	ПолигоныОпределенияСменыМаршрутизацииСрезПоследних.ПолигонУчитывается КАК ПолигонУчитывается
		|ПОМЕСТИТЬ ВТ_Полигоны
		|ИЗ
		|	РегистрСведений.ПолигоныОпределенияСменыМаршрутизации.СрезПоследних КАК ПолигоныОпределенияСменыМаршрутизацииСрезПоследних
		|ГДЕ
		|	ПолигоныОпределенияСменыМаршрутизацииСрезПоследних.НомерПолигонаМаршрутизации В(&СписокПолигонов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Полигоны.НомерПолигонаМаршрутизации КАК НомерПолигонаМаршрутизации
		|ИЗ
		|	ВТ_Полигоны КАК ВТ_Полигоны
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Полигоны КАК ВТ_ПолигоныДоп
		|		ПО ВТ_Полигоны.НомерПолигонаМаршрутизации = ВТ_ПолигоныДоп.НомерПолигонаМаршрутизации
		|			И (ВТ_ПолигоныДоп.Период > ВТ_Полигоны.Период)
		|ГДЕ
		|	ВТ_Полигоны.ПолигонУчитывается
		|	И ВТ_ПолигоныДоп.Период ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("СписокПолигонов", ПолигоныМаршрутизации.ВыгрузитьКолонку("НомерПолигона"));
	
	НомераПолигонов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НомерПолигонаМаршрутизации");
	
	Если НомераПолигонов.Количество() > 0 Тогда
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;	
	
КонецФункции
